Revit 2027 API
RebarRoundingManager.SegmentLengthRoundingMethod Property
 Identifies the segment length rounding method
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RoundingMethod SegmentLengthRoundingMethod { get; set; }
Public Property SegmentLengthRoundingMethod As RoundingMethod
	Get
	Set
public:
property RoundingMethod SegmentLengthRoundingMethod {
	RoundingMethod get ();
	void set (RoundingMethod value);
}
member SegmentLengthRoundingMethod : RoundingMethod with get, set
Property Value
RoundingMethod
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  When setting this property: IsActiveOnElement property is false.
See Also
Reference
RebarRoundingManager Class
Autodesk.Revit.DB.Structure Namespace